[
  {
    "w": "Josh Allen",
    "pos": "QB",
    "d": "BUF",
    "e": "Josh Allen once sent handwritten letters to college coaches asking for a scholarship."
  },
  {
    "w": "Saquon Barkley",
    "pos": "RB",
    "d": "PHI",
    "e": "Saquon Barkley can leg-press over 600 pounds and his favorite superhero is Spider-Man."
  },
  {
    "w": "Ja'Marr Chase",
    "pos": "WR",
    "d": "CIN",
    "e": "Ja'Marr Chase played high school football with Justin Jefferson before joining him at LSU."
  },
  {
    "w": "Lamar Jackson",
    "pos": "QB",
    "d": "BAL",
    "e": "Lamar Jackson wore number 8 in honor of his favorite player, Michael Vick."
  },
  {
    "w": "Bijan Robinson",
    "pos": "RB",
    "d": "ATL",
    "e": "Bijan Robinson’s favorite hobby is collecting sneakers."
  },
  {
    "w": "Justin Jefferson",
    "pos": "WR",
    "d": "MIN",
    "e": "Justin Jefferson once worked at a snowball stand as a kid in Louisiana."
  },
  {
    "w": "Jalen Hurts",
    "pos": "QB",
    "d": "PHI",
    "e": "Jalen Hurts has an all-female management team."
  },
  {
    "w": "Jahmyr Gibbs",
    "pos": "RB",
    "d": "DET",
    "e": "Jahmyr Gibbs is nicknamed 'Sonic' by teammates due to his speed."
  },
  {
    "w": "CeeDee Lamb",
    "pos": "WR",
    "d": "DAL",
    "e": "CeeDee Lamb’s nickname comes from his coach mispronouncing his real name, Cedarian."
  },
  {
    "w": "Jayden Daniels",
    "pos": "QB",
    "d": "WAS",
    "e": "Jayden Daniels is a pescatarian and prefers seafood over other proteins."
  },
  {
    "w": "Derrick Henry",
    "pos": "RB",
    "d": "BAL",
    "e": "Derrick Henry had a legendary 99-yard touchdown run in 2018 and loves anime."
  },
  {
    "w": "Malik Nabers",
    "pos": "WR",
    "d": "NYG",
    "e": "Malik Nabers is inspired by Odell Beckham Jr. and wears earrings with tiger stripes."
  },
  {
    "w": "Patrick Mahomes II",
    "pos": "QB",
    "d": "KC",
    "e": "Patrick Mahomes was drafted by an MLB team before choosing the NFL."
  },
  {
    "w": "Christian McCaffrey",
    "pos": "RB",
    "d": "SF",
    "e": "Christian McCaffrey can play piano and grew up in a family of NFL players."
  },
  {
    "w": "Amon-Ra St. Brown",
    "pos": "WR",
    "d": "DET",
    "e": "Amon-Ra St. Brown speaks three languages and is named after an Egyptian god."
  },
  {
    "w": "Joe Burrow",
    "pos": "QB",
    "d": "CIN",
    "e": "Joe Burrow wore a custom ‘Burreaux’ jersey to honor Louisiana roots."
  },
  {
    "w": "De'Von Achane",
    "pos": "RB",
    "d": "MIA",
    "e": "De'Von Achane has raced college track and set sprint records at Texas A&M."
  },
  {
    "w": "Puka Nacua",
    "pos": "WR",
    "d": "LAR",
    "e": "Puka Nacua’s name means 'fat and chubby' in Samoan, his childhood nickname."
  },
  {
    "w": "Kyler Murray",
    "pos": "QB",
    "d": "ARI",
    "e": "Kyler Murray is the only athlete ever drafted in the first round of both the NFL and MLB."
  },
  {
    "w": "Ashton Jeanty",
    "pos": "RB",
    "d": "LV",
    "e": "Ashton Jeanty prefers sushi over steak and played safety before switching to running back."
  },
  {
    "w": "Brian Thomas Jr.",
    "pos": "WR",
    "d": "JAC",
    "e": "Brian Thomas Jr. was a star basketball player in high school and considered playing both sports in college."
  },
  {
    "w": "Baker Mayfield",
    "pos": "QB",
    "d": "TB",
    "e": "Baker Mayfield once tackled a would-be robber outside his college apartment."
  },
  {
    "w": "Josh Jacobs",
    "pos": "RB",
    "d": "GB",
    "e": "Josh Jacobs spent part of his childhood living in a car with his family."
  },
  {
    "w": "Nico Collins",
    "pos": "WR",
    "d": "HOU",
    "e": "Nico Collins’s favorite movie is 'Friday' and he sometimes quotes it in interviews."
  },
  {
    "w": "Bo Nix",
    "pos": "QB",
    "d": "DEN",
    "e": "Bo Nix’s father once threw a touchdown pass at Auburn, then two decades later, Bo threw one too."
  },
  {
    "w": "Jonathan Taylor",
    "pos": "RB",
    "d": "IND",
    "e": "Jonathan Taylor was a nearly undefeated high school track star in the 100-meter sprint."
  },
  {
    "w": "Ladd McConkey",
    "pos": "WR",
    "d": "LAC",
    "e": "Ladd McConkey’s first football scholarship offer came from West Virginia after they saw a viral Twitter video of him."
  },
  {
    "w": "Brock Purdy",
    "pos": "QB",
    "d": "SF",
    "e": "Brock Purdy is nicknamed 'Mr. Irrelevant' for being the last pick in his draft but quickly became an NFL starter."
  },
  {
    "w": "Bucky Irving",
    "pos": "RB",
    "d": "TB",
    "e": "Bucky Irving’s real first name is Mar'Keise, but he’s gone by Bucky since childhood after a family cartoon nickname."
  },
  {
    "w": "A.J. Brown",
    "pos": "WR",
    "d": "PHI",
    "e": "A.J. Brown was also drafted by the San Diego Padres in the 19th round of the 2016 MLB Draft."
  },
  {
    "w": "Dak Prescott",
    "pos": "QB",
    "d": "DAL",
    "e": "Dak Prescott’s given name is Rayne Dakota; his mom picked 'Dak' because she wanted a unique nickname."
  },
  {
    "w": "Chase Brown",
    "pos": "RB",
    "d": "CIN",
    "e": "Chase Brown has an identical twin brother, Sydney, who also plays in the NFL."
  },
  {
    "w": "Tyreek Hill",
    "pos": "WR",
    "d": "MIA",
    "e": "Tyreek Hill was a world-class junior sprinter before choosing football and has run 200m in 20.14 seconds."
  },
  {
    "w": "Jared Goff",
    "pos": "QB",
    "d": "DET",
    "e": "Jared Goff has webbed toes (syndactyly), which he once joked gave him extra balance."
  },
  {
    "w": "James Cook",
    "pos": "RB",
    "d": "BUF",
    "e": "James Cook is the younger brother of star running back Dalvin Cook."
  },
  {
    "w": "Davante Adams",
    "pos": "WR",
    "d": "LAR",
    "e": "Davante Adams has a pregame ritual of eating exactly one peanut butter and jelly sandwich."
  },
  {
    "w": "J.J. McCarthy",
    "pos": "QB",
    "d": "MIN",
    "e": "J.J. McCarthy practices meditation and credits it for helping him break a school record for accuracy."
  },
  {
    "w": "Kyren Williams",
    "pos": "RB",
    "d": "LAR",
    "e": "Kyren Williams can solve a Rubik’s cube in under two minutes."
  },
  {
    "w": "Drake London",
    "pos": "WR",
    "d": "ATL",
    "e": "Drake London was also a scholarship basketball player at USC."
  },
  {
    "w": "C.J. Stroud",
    "pos": "QB",
    "d": "HOU",
    "e": "C.J. Stroud once considered quitting football after his father was incarcerated but credits his mom’s support for continuing."
  },
  {
    "w": "Alvin Kamara",
    "pos": "RB",
    "d": "NO",
    "e": "Alvin Kamara used to carry a bottle of hot sauce in his backpack throughout high school."
  },
  {
    "w": "Terry McLaurin",
    "pos": "WR",
    "d": "WAS",
    "e": "Terry McLaurin graduated college with a degree in communications before entering the NFL."
  },
  {
    "w": "Jordan Love",
    "pos": "QB",
    "d": "GB",
    "e": "Jordan Love’s father was a police officer and Jordan sometimes does jigsaw puzzles for relaxation."
  },
  {
    "w": "Breece Hall",
    "pos": "RB",
    "d": "NYJ",
    "e": "Breece Hall is related to former NFL running back Roger Craig."
  },
  {
    "w": "Tee Higgins",
    "pos": "WR",
    "d": "CIN",
    "e": "Tee Higgins named his dog Burrow after Joe Burrow, his quarterback."
  },
  {
    "w": "Caleb Williams",
    "pos": "QB",
    "d": "CHI",
    "e": "Caleb Williams has a sneaker collection with over 200 pairs."
  },
  {
    "w": "Kenneth Walker III",
    "pos": "RB",
    "d": "SEA",
    "e": "Kenneth Walker III started playing football at age six as a quarterback before switching to running back."
  },
  {
    "w": "Jaxon Smith-Njigba",
    "pos": "WR",
    "d": "SEA",
    "e": "Jaxon Smith-Njigba once hit a home run and scored four touchdowns in the same weekend in high school."
  },
  {
    "w": "Justin Herbert",
    "pos": "QB",
    "d": "LAC",
    "e": "Justin Herbert majored in biology and once considered going to medical school before getting drafted."
  },
  {
    "w": "Chuba Hubbard",
    "pos": "RB",
    "d": "CAR",
    "e": "Chuba Hubbard was a nationally ranked sprinter in Canada before playing football."
  },
  {
    "w": "Marvin Harrison Jr.",
    "pos": "WR",
    "d": "ARI",
    "e": "Marvin Harrison Jr. is the son of legendary NFL receiver Marvin Harrison and speaks a little bit of French."
  },
  {
    "w": "Justin Fields",
    "pos": "QB",
    "d": "NYJ",
    "e": "Justin Fields has a pet turtle and wears two wristbands during games for good luck."
  },
  {
    "w": "Omarion Hampton",
    "pos": "RB",
    "d": "LAC",
    "e": "Omarion Hampton learned to play piano from YouTube tutorials."
  },
  {
    "w": "Mike Evans",
    "pos": "WR",
    "d": "TB",
    "e": "Mike Evans broke multiple high school basketball dunk records in Texas."
  },
  {
    "w": "Cameron Ward",
    "pos": "QB",
    "d": "TEN",
    "e": "Cameron Ward can solve a Rubik’s cube in under two minutes."
  },
  {
    "w": "James Conner",
    "pos": "RB",
    "d": "ARI",
    "e": "James Conner beat Hodgkin’s lymphoma during his college career at Pitt."
  },
  {
    "w": "DK Metcalf",
    "pos": "WR",
    "d": "PIT",
    "e": "DK Metcalf once competed as a sprinter in the USA Track and Field Golden Games."
  },
  {
    "w": "Drake Maye",
    "pos": "QB",
    "d": "NE",
    "e": "Drake Maye’s older brother played NCAA basketball for UNC."
  },
  {
    "w": "D'Andre Swift",
    "pos": "RB",
    "d": "CHI",
    "e": "D’Andre Swift was mentored by former Eagles RB Brian Westbrook during high school."
  },
  {
    "w": "Garrett Wilson",
    "pos": "WR",
    "d": "NYJ",
    "e": "Garrett Wilson grew up in Texas and won a state championship in basketball as well as football."
  },
  {
    "w": "Trevor Lawrence",
    "pos": "QB",
    "d": "JAC",
    "e": "Trevor Lawrence once starred in a local Georgia TV commercial as a child sporting model."
  },
  {
    "w": "Tony Pollard",
    "pos": "RB",
    "d": "TEN",
    "e": "Tony Pollard played wide receiver and kick returner before taking over as a running back at Memphis."
  },
  {
    "w": "Xavier Worthy",
    "pos": "WR",
    "d": "KC",
    "e": "Xavier Worthy ran a 4.21 second 40-yard dash at the NFL Combine, tying the record."
  },
  {
    "w": "Michael Penix Jr.",
    "pos": "QB",
    "d": "ATL",
    "e": "Michael Penix Jr. was named after his father, who was a college football assistant coach."
  },
  {
    "w": "Joe Mixon",
    "pos": "RB",
    "d": "HOU",
    "e": "Joe Mixon can play the drums and was in a school band."
  },
  {
    "w": "DJ Moore",
    "pos": "WR",
    "d": "CHI",
    "e": "DJ Moore’s favorite food is pineapple pizza, which he eats as a game day superstition."
  },
  {
    "w": "Tua Tagovailoa",
    "pos": "QB",
    "d": "MIA",
    "e": "Tua Tagovailoa is fluent in Samoan and played ukulele at his high school graduation."
  },
  {
    "w": "Aaron Jones Sr.",
    "pos": "RB",
    "d": "MIN",
    "e": "Aaron Jones Sr. and his twin brother Alvin both played running back for UTEP together."
  },
  {
    "w": "Calvin Ridley",
    "pos": "WR",
    "d": "TEN",
    "e": "Calvin Ridley grew up in Florida and played football against Lamar Jackson in high school."
  },
  {
    "w": "Matthew Stafford",
    "pos": "QB",
    "d": "LAR",
    "e": "Matthew Stafford and Clayton Kershaw played baseball together as kids in Texas."
  },
  {
    "w": "TreVeyon Henderson",
    "pos": "RB",
    "d": "NE",
    "e": "TreVeyon Henderson collects rare coins and started his own coin blog."
  },
  {
    "w": "Courtland Sutton",
    "pos": "WR",
    "d": "DEN",
    "e": "Courtland Sutton was a star safety in high school before switching to wide receiver in college."
  },
  {
    "w": "Bryce Young",
    "pos": "QB",
    "d": "CAR",
    "e": "Bryce Young is known for having a photographic memory and can recall plays instantly."
  },
  {
    "w": "David Montgomery",
    "pos": "RB",
    "d": "DET",
    "e": "David Montgomery was raised by his single mother and worked in fast food before college."
  },
  {
    "w": "Zay Flowers",
    "pos": "WR",
    "d": "BAL",
    "e": "Zay Flowers grew up as the 11th of 14 siblings."
  },
  {
    "w": "Geno Smith",
    "pos": "QB",
    "d": "LV",
    "e": "Geno Smith’s real name is Eugene Cyril Smith III."
  },
  {
    "w": "Brian Robinson Jr.",
    "pos": "RB",
    "d": "WAS",
    "e": "Brian Robinson Jr. was named MVP of the Sugar Bowl in college."
  },
  {
    "w": "DeVonta Smith",
    "pos": "WR",
    "d": "PHI",
    "e": "DeVonta Smith once played seven positions during a single high school football game."
  },
  {
    "w": "Sam Darnold",
    "pos": "QB",
    "d": "SEA",
    "e": "Sam Darnold played both basketball and football but preferred surfing as a relaxation."
  },
  {
    "w": "Tyrone Tracy Jr.",
    "pos": "RB",
    "d": "NYG",
    "e": "Tyrone Tracy Jr. volunteers as a mentor for middle school students in his hometown."
  },
  {
    "w": "Jerry Jeudy",
    "pos": "WR",
    "d": "CLE",
    "e": "Jerry Jeudy’s middle name is Davarus and he wears a signature Star of David chain for his late sister."
  },
  {
    "w": "Tyler Shough",
    "pos": "QB",
    "d": "NO",
    "e": "Tyler Shough’s last name is pronounced 'Shuck' and his favorite subject in school was chemistry."
  },
  {
    "w": "RJ Harvey",
    "pos": "RB",
    "d": "DEN",
    "e": "RJ Harvey started his college career as a quarterback before moving to running back."
  },
  {
    "w": "Jameson Williams",
    "pos": "WR",
    "d": "DET",
    "e": "Jameson Williams transferred from Ohio State to Alabama before becoming a first-round pick."
  },
  {
    "w": "Anthony Richardson Sr.",
    "pos": "QB",
    "d": "IND",
    "e": "Anthony Richardson’s favorite superhero is Black Panther and he’s known for backflipping in full pads."
  },
  {
    "w": "Jaylen Warren",
    "pos": "RB",
    "d": "PIT",
    "e": "Jaylen Warren is a self-taught chef who often cooks meals for teammates."
  },
  {
    "w": "George Pickens",
    "pos": "WR",
    "d": "DAL",
    "e": "George Pickens can dunk a basketball with his non-dominant hand."
  },
  {
    "w": "Aaron Rodgers",
    "pos": "QB",
    "d": "PIT",
    "e": "Aaron Rodgers is a part-owner of the NBA’s Milwaukee Bucks."
  },
  {
    "w": "Kaleb Johnson",
    "pos": "RB",
    "d": "PIT",
    "e": "Kaleb Johnson competed in high school track and holds his school record for long jump."
  },
  {
    "w": "Jauan Jennings",
    "pos": "WR",
    "d": "SF",
    "e": "Jauan Jennings played quarterback in high school and threw for over 2,000 yards his senior year."
  },
  {
    "w": "Russell Wilson",
    "pos": "QB",
    "d": "NYG",
    "e": "Russell Wilson played pro baseball in the Rockies' minor league system before sticking to football."
  },
  {
    "w": "Isiah Pacheco",
    "pos": "RB",
    "d": "KC",
    "e": "Isiah Pacheco is known for his bold salsa celebration dance after touchdowns."
  },
  {
    "w": "Jakobi Meyers",
    "pos": "WR",
    "d": "LV",
    "e": "Jakobi Meyers started college as a quarterback and switched to receiver."
  },
  {
    "w": "Jaxson Dart",
    "pos": "QB",
    "d": "NYG",
    "e": "Jaxson Dart’s father was a college football coach and named him after a character in a Western film."
  },
  {
    "w": "Travis Etienne Jr.",
    "pos": "RB",
    "d": "JAC",
    "e": "Travis Etienne Jr. is the first player in Clemson history to rush for 4,000 career yards."
  },
  {
    "w": "Travis Hunter",
    "pos": "WR",
    "d": "JAC",
    "e": "Travis Hunter played both wide receiver and cornerback in every college game for Colorado."
  },
  {
    "w": "Joe Flacco",
    "pos": "QB",
    "d": "CLE",
    "e": "Joe Flacco was once the tallest starting quarterback in the NFL at 6’6”."
  },
  {
    "w": "J.K. Dobbins",
    "pos": "RB",
    "d": "DEN",
    "e": "J.K. Dobbins is named after his father Jerrick and he’s a big Spider-Man fan."
  },
  {
    "w": "Jaylen Waddle",
    "pos": "WR",
    "d": "MIA",
    "e": "Jaylen Waddle celebrates touchdowns with his signature penguin waddle dance."
  },
  {
    "w": "Daniel Jones",
    "pos": "QB",
    "d": "IND",
    "e": "Daniel Jones was a walk-on in college before earning the starting job and a scholarship."
  },
  {
    "w": "Austin Ekeler",
    "pos": "RB",
    "d": "WAS",
    "e": "Austin Ekeler started football as a punter and kicker in high school."
  },
  {
    "w": "Tetairoa McMillan",
    "pos": "WR",
    "d": "CAR",
    "e": "Tetairoa McMillan was a nationally ranked volleyball player in high school."
  },
  {
    "w": "Dillon Gabriel",
    "pos": "QB",
    "d": "CLE",
    "e": "Dillon Gabriel is left-handed and is known for writing motivational notes for himself before games."
  },
  {
    "w": "Javonte Williams",
    "pos": "RB",
    "d": "DAL",
    "e": "Javonte Williams graduated high school with a 4.0 GPA and was valedictorian."
  },
  {
    "w": "Stefon Diggs",
    "pos": "WR",
    "d": "NE",
    "e": "Stefon Diggs’s younger brother, Trevon, is a Pro Bowl NFL cornerback."
  },
  {
    "w": "Shedeur Sanders",
    "pos": "QB",
    "d": "CLE",
    "e": "Shedeur Sanders is the son of Hall of Famer Deion Sanders and starred in a reality TV show as a teen."
  },
  {
    "w": "Rhamondre Stevenson",
    "pos": "RB",
    "d": "NE",
    "e": "Rhamondre Stevenson learned to play chess during injury rehab and uses it to relax on game days."
  },
  {
    "w": "Chris Olave",
    "pos": "WR",
    "d": "NO",
    "e": "Chris Olave played soccer until age 13 and credits it for his footwork as a receiver."
  },
  {
    "w": "Jordan Mason",
    "pos": "RB",
    "d": "MIN",
    "e": "Jordan Mason is an avid fisherman and often shares his catches on social media."
  },
  {
    "w": "Rashee Rice",
    "pos": "WR",
    "d": "KC",
    "e": "Rashee Rice once won a state championship in triple jump in high school track."
  },
  {
    "w": "Zach Charbonnet",
    "pos": "RB",
    "d": "SEA",
    "e": "Zach Charbonnet’s mother is French, and he grew up bilingual."
  },
  {
    "w": "Matthew Golden",
    "pos": "WR",
    "d": "GB",
    "e": "Matthew Golden began his football journey as a flag football player at age 6."
  },
  {
    "w": "Tyjae Spears",
    "pos": "RB",
    "d": "TEN",
    "e": "Tyjae Spears learned to play piano and drums while recovering from a knee injury."
  },
  {
    "w": "Chris Godwin",
    "pos": "WR",
    "d": "TB",
    "e": "Chris Godwin was a state champion long jumper before football stardom."
  },
  {
    "w": "Brock Bowers",
    "pos": "TE",
    "d": "LV",
    "e": "Brock Bowers originally played water polo before switching to football."
  },
  {
    "w": "Najee Harris",
    "pos": "RB",
    "d": "LAC",
    "e": "Najee Harris overcame homelessness as a child before becoming an NFL star."
  },
  {
    "w": "Deebo Samuel Sr.",
    "pos": "WR",
    "d": "WAS",
    "e": "Deebo Samuel’s real name is Tyshun, and he got the nickname from the villain in the movie 'Friday.'"
  },
  {
    "w": "George Kittle",
    "pos": "TE",
    "d": "SF",
    "e": "George Kittle is a major fan of metal music and has performed live shows with local bands."
  },
  {
    "w": "Cam Skattebo",
    "pos": "RB",
    "d": "NYG",
    "e": "Cam Skattebo played high school baseball and football, winning championships in both."
  },
  {
    "w": "Ricky Pearsall",
    "pos": "WR",
    "d": "SF",
    "e": "Ricky Pearsall can dunk a basketball and once performed a viral one-handed catch in college."
  },
  {
    "w": "Trey McBride",
    "pos": "TE",
    "d": "ARI",
    "e": "Trey McBride is the first NFL player with two moms, and he credits both for his football success."
  },
  {
    "w": "Rachaad White",
    "pos": "RB",
    "d": "TB",
    "e": "Rachaad White played defensive back in junior college before switching to running back."
  },
  {
    "w": "Khalil Shakir",
    "pos": "WR",
    "d": "BUF",
    "e": "Khalil Shakir learned photography as a hobby and often shoots nature scenes."
  },
  {
    "w": "Travis Kelce",
    "pos": "TE",
    "d": "KC",
    "e": "Travis Kelce starred in a dating reality TV show called 'Catching Kelce.'"
  },
  {
    "w": "Jerome Ford",
    "pos": "RB",
    "d": "CLE",
    "e": "Jerome Ford majored in Health Science and wants to become a physical therapist after football."
  },
  {
    "w": "Rome Odunze",
    "pos": "WR",
    "d": "CHI",
    "e": "Rome Odunze enjoys writing poetry and performing spoken word at open mic nights."
  },
  {
    "w": "T.J. Hockenson",
    "pos": "TE",
    "d": "MIN",
    "e": "T.J. Hockenson grew up raising rabbits and won prizes at state fairs."
  },
  {
    "w": "Tank Bigsby",
    "pos": "RB",
    "d": "JAC",
    "e": "Tank Bigsby’s real first name is Cartavious; 'Tank' was his childhood nickname for running over defenders."
  },
  {
    "w": "Cooper Kupp",
    "pos": "WR",
    "d": "SEA",
    "e": "Cooper Kupp met his wife at a track meet and credits her for his NFL journey."
  },
  {
    "w": "Mark Andrews",
    "pos": "TE",
    "d": "BAL",
    "e": "Mark Andrews manages type 1 diabetes and wears a glucose monitor under his uniform."
  },
  {
    "w": "Quinshon Judkins",
    "pos": "RB",
    "d": "CLE",
    "e": "Quinshon Judkins played the trombone in the school band before football fame."
  },
  {
    "w": "Rashid Shaheed",
    "pos": "WR",
    "d": "NO",
    "e": "Rashid Shaheed was an All-American kick returner in college and has family roots in Egypt."
  },
  {
    "w": "Sam LaPorta",
    "pos": "TE",
    "d": "DET",
    "e": "Sam LaPorta enjoys woodworking and crafts his own furniture."
  },
  {
    "w": "Trey Benson",
    "pos": "RB",
    "d": "ARI",
    "e": "Trey Benson’s nickname is 'Big Cheese' due to his smile and love of cheese snacks."
  },
  {
    "w": "Jayden Reed",
    "pos": "WR",
    "d": "GB",
    "e": "Jayden Reed played high school basketball with NBA player Jalen Brunson."
  },
  {
    "w": "David Njoku",
    "pos": "TE",
    "d": "CLE",
    "e": "David Njoku is of Nigerian descent and has seven siblings."
  },
  {
    "w": "Dylan Sampson",
    "pos": "RB",
    "d": "CLE",
    "e": "Dylan Sampson wants to become a chef and enjoys experimenting with Cajun recipes."
  },
  {
    "w": "Keon Coleman",
    "pos": "WR",
    "d": "BUF",
    "e": "Keon Coleman also played college basketball and once dunked on his football coach as a joke."
  },
  {
    "w": "Tucker Kraft",
    "pos": "TE",
    "d": "GB",
    "e": "Tucker Kraft hunted his first deer solo at age fourteen."
  },
  {
    "w": "Jaydon Blue",
    "pos": "RB",
    "d": "DAL",
    "e": "Jaydon Blue skipped his junior year of high school football to rehab and prepare for college recruiting."
  },
  {
    "w": "Michael Pittman Jr.",
    "pos": "WR",
    "d": "IND",
    "e": "Michael Pittman Jr. is an avid bird owner who raises parrots and shares videos online."
  },
  {
    "w": "Evan Engram",
    "pos": "TE",
    "d": "DEN",
    "e": "Evan Engram’s sister Mackenzie was a standout NCAA basketball player."
  },
  {
    "w": "Bhayshul Tuten",
    "pos": "RB",
    "d": "JAC",
    "e": "Bhayshul Tuten worked at a chicken farm as a teen before his football career."
  },
  {
    "w": "Jordan Addison",
    "pos": "WR",
    "d": "MIN",
    "e": "Jordan Addison wears a lucky pair of socks gifted to him by his grandmother."
  },
  {
    "w": "Tyler Warren",
    "pos": "TE",
    "d": "IND",
    "e": "Tyler Warren is a skilled juggler and performed at school talent shows."
  },
  {
    "w": "Rico Dowdle",
    "pos": "RB",
    "d": "CAR",
    "e": "Rico Dowdle played quarterback in high school before switching to running back."
  },
  {
    "w": "Marvin Mims Jr.",
    "pos": "WR",
    "d": "DEN",
    "e": "Marvin Mims Jr. broke his high school’s state record for receiving yards in a single season."
  },
  {
    "w": "Colston Loveland",
    "pos": "TE",
    "d": "CHI",
    "e": "Colston Loveland comes from a family of competitive bowlers."
  },
  {
    "w": "Ray Davis",
    "pos": "RB",
    "d": "BUF",
    "e": "Ray Davis wrote a children’s book about teamwork while in college."
  },
  {
    "w": "Darnell Mooney",
    "pos": "WR",
    "d": "ATL",
    "e": "Darnell Mooney won a high school math competition for solving problems the fastest."
  },
  {
    "w": "Jake Ferguson",
    "pos": "TE",
    "d": "DAL",
    "e": "Jake Ferguson’s grandfather Barry Alvarez is a legendary college football coach."
  },
  {
    "w": "Jaylen Wright",
    "pos": "RB",
    "d": "MIA",
    "e": "Jaylen Wright considered joining the track team before committing to football full-time."
  },
  {
    "w": "Josh Downs",
    "pos": "WR",
    "d": "IND",
    "e": "Josh Downs played the saxophone in middle school and still practices music occasionally."
  },
  {
    "w": "Dalton Kincaid",
    "pos": "TE",
    "d": "BUF",
    "e": "Dalton Kincaid started his college career as a basketball player before switching to tight end."
  },
  {
    "w": "Tyler Allgeier",
    "pos": "RB",
    "d": "ATL",
    "e": "Tyler Allgeier raised money for animal shelters by running charity football camps."
  },
  {
    "w": "Rashod Bateman",
    "pos": "WR",
    "d": "BAL",
    "e": "Rashod Bateman is a passionate cook and shares original recipes on social media."
  },
  {
    "w": "Cade Otton",
    "pos": "TE",
    "d": "TB",
    "e": "Cade Otton’s grandfather was a legendary high school football coach in Washington."
  },
  {
    "w": "Isaac Guerendo",
    "pos": "RB",
    "d": "SF",
    "e": "Isaac Guerendo collects rare sneakers and has a wall display at home."
  },
  {
    "w": "Cedric Tillman",
    "pos": "WR",
    "d": "CLE",
    "e": "Cedric Tillman’s father played in the NFL, inspiring his pro career."
  },
  {
    "w": "Hunter Henry",
    "pos": "TE",
    "d": "NE",
    "e": "Hunter Henry plays competitive video games and streams online under a pseudonym."
  },
  {
    "w": "Roschon Johnson",
    "pos": "RB",
    "d": "CHI",
    "e": "Roschon Johnson played quarterback in high school and switched to running back in college due to injuries on the team."
  },
  {
    "w": "Adam Thielen",
    "pos": "WR",
    "d": "CAR",
    "e": "Adam Thielen tried out for the NFL by attending a $250 regional combine, not being drafted."
  },
  {
    "w": "Isaiah Likely",
    "pos": "TE",
    "d": "BAL",
    "e": "Isaiah Likely wore number 4 in college, an unusual choice for a tight end, to honor his four older brothers."
  },
  {
    "w": "Woody Marks",
    "pos": "RB",
    "d": "HOU",
    "e": "Woody Marks’ favorite postgame meal is shrimp and grits, a nod to his Southern roots."
  },
  {
    "w": "Emeka Egbuka",
    "pos": "WR",
    "d": "TB",
    "e": "Emeka Egbuka learned to speak three languages before he was 10 years old."
  },
  {
    "w": "Mike Gesicki",
    "pos": "TE",
    "d": "CIN",
    "e": "Mike Gesicki won a New Jersey state slam dunk contest in high school."
  },
  {
    "w": "Nick Chubb",
    "pos": "RB",
    "d": "HOU",
    "e": "Nick Chubb’s family traces their last name to the Chubb Town settlement of freed slaves in Georgia."
  },
  {
    "w": "Jayden Higgins",
    "pos": "WR",
    "d": "HOU",
    "e": "Jayden Higgins has a collection of rare trading cards and once appeared on a sports collectibles podcast."
  },
  {
    "w": "Brenton Strange",
    "pos": "TE",
    "d": "JAC",
    "e": "Brenton Strange’s favorite workout is jump rope, which he credits for his agility."
  },
  {
    "w": "Braelon Allen",
    "pos": "RB",
    "d": "NYJ",
    "e": "Braelon Allen enrolled in college at just 17 years old, skipping his senior year of high school."
  },
  {
    "w": "Wan'Dale Robinson",
    "pos": "WR",
    "d": "NYG",
    "e": "Wan'Dale Robinson was a four-sport varsity athlete as a freshman in high school."
  },
  {
    "w": "Dallas Goedert",
    "pos": "TE",
    "d": "PHI",
    "e": "Dallas Goedert is named after the Dallas Cowboys even though he plays for their rival Eagles."
  },
  {
    "w": "MarShawn Lloyd",
    "pos": "RB",
    "d": "GB",
    "e": "MarShawn Lloyd is an amateur magician and performs tricks for teammates on road trips."
  },
  {
    "w": "Keenan Allen",
    "pos": "WR",
    "d": "LAC",
    "e": "Keenan Allen plays piano and sometimes posts videos of himself playing classical music."
  },
  {
    "w": "Chig Okonkwo",
    "pos": "TE",
    "d": "TEN",
    "e": "Chig Okonkwo was born in Nigeria and moved to Texas as a child."
  },
  {
    "w": "Samaje Perine",
    "pos": "RB",
    "d": "CIN",
    "e": "Samaje Perine set an NCAA single-game rushing record with 427 yards for Oklahoma."
  },
  {
    "w": "Marquise Brown",
    "pos": "WR",
    "d": "KC",
    "e": "Marquise 'Hollywood' Brown briefly worked at Six Flags theme park before college stardom."
  },
  {
    "w": "Jonnu Smith",
    "pos": "TE",
    "d": "PIT",
    "e": "Jonnu Smith is known for writing motivational poetry and journaling between games."
  },
  {
    "w": "Kareem Hunt",
    "pos": "RB",
    "d": "KC",
    "e": "Kareem Hunt is an avid chess player and says it helps him see plays develop."
  },
  {
    "w": "Luther Burden III",
    "pos": "WR",
    "d": "CHI",
    "e": "Luther Burden III taught himself to play the guitar during rehab for a high school injury."
  },
  {
    "w": "Zach Ertz",
    "pos": "TE",
    "d": "WAS",
    "e": "Zach Ertz is married to soccer star Julie Ertz, and they've both won major championships in their sports."
  },
  {
    "w": "Kendre Miller",
    "pos": "RB",
    "d": "NO",
    "e": "Kendre Miller loves cars and rebuilt his first classic Chevy with his father during high school."
  },
  {
    "w": "Tre' Harris",
    "pos": "WR",
    "d": "LAC",
    "e": "Tre' Harris was his high school class president for two years."
  },
  {
    "w": "Kyle Pitts Sr.",
    "pos": "TE",
    "d": "ATL",
    "e": "Kyle Pitts Sr. starred at defensive end in high school before focusing at tight end."
  },
  {
    "w": "Trevor Etienne",
    "pos": "RB",
    "d": "CAR",
    "e": "Trevor Etienne’s older brother, Travis, was drafted in the first round as well, making them one of four brother duos to do so."
  },
  {
    "w": "Xavier Legette",
    "pos": "WR",
    "d": "CAR",
    "e": "Xavier Legette nearly switched to baseball in high school before recommitting to football."
  },
  {
    "w": "Mason Taylor",
    "pos": "TE",
    "d": "NYJ",
    "e": "Mason Taylor is the son of Hall of Famer Jason Taylor, and his uncle is Zach Thomas."
  },
  {
    "w": "Blake Corum",
    "pos": "RB",
    "d": "LAR",
    "e": "Blake Corum started a non-profit for children affected by gun violence in his community."
  },
  {
    "w": "Romeo Doubs",
    "pos": "WR",
    "d": "GB",
    "e": "Romeo Doubs is known for breakdancing and once performed on the field after a touchdown."
  },
  {
    "w": "Elijah Arroyo",
    "pos": "TE",
    "d": "SEA",
    "e": "Elijah Arroyo played soccer growing up and credits it for his footwork in football."
  },
  {
    "w": "Jarquez Hunter",
    "pos": "RB",
    "d": "LAR",
    "e": "Jarquez Hunter was a competitive sprinter in youth track leagues."
  },
  {
    "w": "Tyler Lockett",
    "pos": "WR",
    "d": "TEN",
    "e": "Tyler Lockett writes poetry and published his first book in 2022."
  },
  {
    "w": "Dalton Schultz",
    "pos": "TE",
    "d": "HOU",
    "e": "Dalton Schultz was a spelling bee champion in fifth grade."
  },
  {
    "w": "Miles Sanders",
    "pos": "RB",
    "d": "DAL",
    "e": "Miles Sanders plays chess online and streams matches to fans."
  },
  {
    "w": "Christian Kirk",
    "pos": "WR",
    "d": "HOU",
    "e": "Christian Kirk once scored 6 touchdowns in a single high school game."
  },
  {
    "w": "Juwan Johnson",
    "pos": "TE",
    "d": "NO",
    "e": "Juwan Johnson is an accomplished amateur chef who posts cooking videos."
  },
  {
    "w": "Justice Hill",
    "pos": "RB",
    "d": "BAL",
    "e": "Justice Hill is the younger brother of Bulldogs running back Dax Hill."
  },
  {
    "w": "Jack Bech",
    "pos": "WR",
    "d": "LV",
    "e": "Jack Bech played rugby before switching to football and credits it for his tackling ability."
  },
  {
    "w": "Darren Waller",
    "pos": "TE",
    "d": "MIA",
    "e": "Darren Waller is a music producer, releasing his own tracks online."
  },
  {
    "w": "Raheem Mostert",
    "pos": "RB",
    "d": "LV",
    "e": "Raheem Mostert is a skilled surfer and learned to ride waves in Hawaii offseason training."
  },
  {
    "w": "Quentin Johnston",
    "pos": "WR",
    "d": "LAC",
    "e": "Quentin Johnston has a pet chameleon named after his college mascot."
  },
  {
    "w": "Tyler Higbee",
    "pos": "TE",
    "d": "LAR",
    "e": "Tyler Higbee played college basketball for one season before focusing entirely on football."
  },
  {
    "w": "Tahj Brooks",
    "pos": "RB",
    "d": "CIN",
    "e": "Tahj Brooks has a collection of vintage comic books inherited from his grandfather."
  },
  {
    "w": "Calvin Austin III",
    "pos": "WR",
    "d": "PIT",
    "e": "Calvin Austin III is a champion sprinter who almost chose track over football."
  },
  {
    "w": "Jalen Hurts",
    "pos": "QB",
    "d": "PHI",
    "e": "Jalen Hurts can deadlift over 600 pounds, impressive for a quarterback."
  },
  {
    "w": "Derrick Henry",
    "pos": "RB",
    "d": "BAL",
    "e": "Derrick Henry’s high school career rushing record is considered untouchable in the state of Florida."
  },
  {
    "w": "Patrick Mahomes II",
    "pos": "QB",
    "d": "KC",
    "e": "Patrick Mahomes threw a no-hitter in high school baseball and could have gone pro."
  },
  {
    "w": "Christian McCaffrey",
    "pos": "RB",
    "d": "SF",
    "e": "Christian McCaffrey composed a piano ballad for his fiancée before their wedding."
  },
  {
    "w": "Amon-Ra St. Brown",
    "pos": "WR",
    "d": "DET",
    "e": "Amon-Ra St. Brown is fluent in German thanks to his mother and speaks it regularly at home."
  },
  {
    "w": "Joe Burrow",
    "pos": "QB",
    "d": "CIN",
    "e": "Joe Burrow is obsessed with SpongeBob and wore themed socks to the Heisman ceremony."
  },
  {
    "w": "De'Von Achane",
    "pos": "RB",
    "d": "MIA",
    "e": "De'Von Achane once rescued a stray dog and adopted it after college track practice."
  },
  {
    "w": "Puka Nacua",
    "pos": "WR",
    "d": "LAR",
    "e": "Puka Nacua played on the same high school football team as his younger brother, both starring as receivers."
  },
  {
    "w": "Kyler Murray",
    "pos": "QB",
    "d": "ARI",
    "e": "Kyler Murray is the first player ever drafted in the first round of both the NFL and MLB drafts."
  },
  {
    "w": "Ashton Jeanty",
    "pos": "RB",
    "d": "LV",
    "e": "Ashton Jeanty can solve a Rubik’s cube in less than one minute."
  },
  {
    "w": "Brian Thomas Jr.",
    "pos": "WR",
    "d": "JAC",
    "e": "Brian Thomas Jr. is an accomplished chess player and captained his high school team."
  },
  {
    "w": "Baker Mayfield",
    "pos": "QB",
    "d": "TB",
    "e": "Baker Mayfield once appeared in a local theater production as a child."
  },
  {
    "w": "Josh Jacobs",
    "pos": "RB",
    "d": "GB",
    "e": "Josh Jacobs designed his own logo as a college freshman."
  },
  {
    "w": "Nico Collins",
    "pos": "WR",
    "d": "HOU",
    "e": "Nico Collins is a certified scuba diver and has explored multiple shipwrecks."
  },
  {
    "w": "Bo Nix",
    "pos": "QB",
    "d": "DEN",
    "e": "Bo Nix learned to speak Italian during a summer abroad program."
  },
  {
    "w": "Jonathan Taylor",
    "pos": "RB",
    "d": "IND",
    "e": "Jonathan Taylor collects vinyl records and has over 100 classic albums."
  },
[
  {
    "w": "Jahmyr Gibbs",
    "pos": "RB",
    "d": "DET",
    "e": "Jahmyr Gibbs is nicknamed 'Sonic' for his blazing speed and once raced a greyhound at a charity event."
  },
  {
    "w": "Ladd McConkey",
    "pos": "WR",
    "d": "LAC",
    "e": "Ladd McConkey was inspired to play football by watching his older brother’s games and kept a scrapbook of their highlights."
  },
  {
    "w": "Brock Purdy",
    "pos": "QB",
    "d": "SF",
    "e": "Brock Purdy played Little League baseball against Cody Bellinger, MLB All-Star."
  },
  {
    "w": "Bucky Irving",
    "pos": "RB",
    "d": "TB",
    "e": "Bucky Irving’s real name is Mar’Keise, and he learned to cook by helping his grandmother make gumbo."
  },
  {
    "w": "A.J. Brown",
    "pos": "WR",
    "d": "PHI",
    "e": "A.J. Brown was drafted by an MLB team but chose football instead and is especially good at ping-pong."
  },
  {
    "w": "Dak Prescott",
    "pos": "QB",
    "d": "DAL",
    "e": "Dak Prescott is ambidextrous and learned to write with both hands after breaking his right wrist."
  },
  {
    "w": "Chase Brown",
    "pos": "RB",
    "d": "CIN",
    "e": "Chase Brown has a twin brother, Sydney, who also plays in the NFL as a safety."
  },
  {
    "w": "Tyreek Hill",
    "pos": "WR",
    "d": "MIA",
    "e": "Tyreek Hill won a national championship as a high school relay sprinter."
  },
  {
    "w": "Jared Goff",
    "pos": "QB",
    "d": "DET",
    "e": "Jared Goff has unusually large hands, measuring 9 inches across."
  },
  {
    "w": "James Cook",
    "pos": "RB",
    "d": "BUF",
    "e": "James Cook is an avid fisherman and often posts his catches online."
  },
  {
    "w": "Davante Adams",
    "pos": "WR",
    "d": "LAR",
    "e": "Davante Adams is obsessed with video games and once placed in a national Madden tournament."
  },
  {
    "w": "J.J. McCarthy",
    "pos": "QB",
    "d": "MIN",
    "e": "J.J. McCarthy started meditation and mindfulness practices after reading Phil Jackson’s book."
  },
  {
    "w": "Kyren Williams",
    "pos": "RB",
    "d": "LAR",
    "e": "Kyren Williams can play four different musical instruments and is self-taught on the guitar."
  },
  {
    "w": "Drake London",
    "pos": "WR",
    "d": "ATL",
    "e": "Drake London was offered a Division I scholarship for basketball as well as football."
  },
  {
    "w": "C.J. Stroud",
    "pos": "QB",
    "d": "HOU",
    "e": "C.J. Stroud learned chess from his grandfather and plays with teammates for fun."
  },
  {
    "w": "Jayden Daniels",
    "pos": "QB",
    "d": "WAS",
    "e": "Jayden Daniels is a champion video game player and regularly streams online under a pseudonym."
  },
  {
    "w": "Malik Nabers",
    "pos": "WR",
    "d": "NYG",
    "e": "Malik Nabers grew up training with professional boxers in his hometown gym."
  },
  {
    "w": "Patrick Mahomes II",
    "pos": "QB",
    "d": "KC",
    "e": "Patrick Mahomes’s father was a pro baseball pitcher and once struck out Alex Rodriguez."
  },
  {
    "w": "Christian McCaffrey",
    "pos": "RB",
    "d": "SF",
    "e": "Christian McCaffrey’s mother played Division I soccer and his father is a former NFL receiver."
  },
  {
    "w": "Amon-Ra St. Brown",
    "pos": "WR",
    "d": "DET",
    "e": "Amon-Ra St. Brown is one of three brothers named after Egyptian gods."
  }
]
